20231231060610-binary_operators.org
:PROPERTIES:
:ID:       9bcf2aef-060a-4011-98b5-cb949a9f7d1a
:END:
#+title: Binary Operators

* Binary Operators
Operators that take *two* operands

A [[id:6fab7cdd-d658-4d28-a1b8-492fc3943dac][unary Operator]] has only *one* operand (*binary* *operator* has two).

For example, the =–= operator in ~–5~ is a [[id:6fab7cdd-d658-4d28-a1b8-492fc3943dac][unary operator]] to negate number ~5~, whereas the =–= operator in ~4 – 5~ is a *binary* *operator* for *subtracting* ~5~ from ~4~.


Used to:
- Perform *mathematical* *operations* on [[id:ace39873-193a-42c3-a97d-0a25e630687e][variables]]
- Create logical expressions
- Perform basic variable assignments.

** [[id:f6e458df-99cf-45d6-b224-16f325cc1d2b][Arithmetic Operators]]
** [[id:32c06110-1f45-4d85-9583-74d13aaa083f][Assignment Operators]]
** [[id:78097da7-2345-4299-8b00-4608c875fb88][Compound Assignment Operators]]
** [[id:700147ef-38e8-47dc-bdda-f675917ae802][Equality Operators]]
** [[id:bf93d4e3-f501-4e73-ac07-e1c6653831ba][Relational Operators]]
** [[id:e5c59266-2989-402e-a1cd-f05b5b29d14a][Logical Operators]]
** [[id:a29b45cb-d2f6-49fd-90c7-4c8f1b8e898a][Conditional Operators]]
** [[id:084b3f68-cbfa-4f4d-b3fb-724a5ae1391b][Exponent Operations]]
