20231231060610-binary_operators.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-08 Sun 09:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Binary Operators</title>
<meta name="author" content="Mikey" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Binary Operators</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5e52390">1. Binary Operator(s)</a>
<ul>
<li><a href="#org4959f53">1.1. Assignment Operators</a></li>
<li><a href="#org3799eea">1.2. Arithmetic Operators</a></li>
<li><a href="#org354142d">1.3. Relational Operators</a></li>
<li><a href="#orgdcf9c73">1.4. Logical Operators</a></li>
<li><a href="#org2e9ab0a">1.5. Compound Assignment Operators</a></li>
<li><a href="#org28898fc">1.6. Equality Operators</a></li>
<li><a href="#orga07ffbe">1.7. Conditional Operators</a></li>
<li><a href="#orgc8ad250">1.8. Exponent Operations</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5e52390" class="outline-2">
<h2 id="org5e52390"><span class="section-number-2">1.</span> Binary Operator(s)</h2>
<div class="outline-text-2" id="text-1">
<p>
Operators that take <b>two</b> operands
</p>

<p>
A <a href="20231231053308-unary_operators.html#ID-6fab7cdd-d658-4d28-a1b8-492fc3943dac">unary Operator</a> has only <b>one</b> operand (<b>binary</b> <b>operator</b> has two).
</p>

<p>
For example, the <code>–</code> operator in <code>–5</code> is a <a href="20231231053308-unary_operators.html#ID-6fab7cdd-d658-4d28-a1b8-492fc3943dac">unary operator</a> to negate number <code>5</code>, whereas the <code>–</code> operator in <code>4 – 5</code> is a <b>binary</b> <b>operator</b> for <b>subtracting</b> <code>5</code> from <code>4</code>.
</p>


<p>
Used to:
</p>
<ul class="org-ul">
<li>Perform <b>mathematical</b> <b>operations</b> on <a href="20260120071543-variables.html#ID-ace39873-193a-42c3-a97d-0a25e630687e">variables</a></li>
<li>Create logical expressions</li>
<li>Perform basic variable assignments.</li>
</ul>
</div>
<div id="outline-container-org4959f53" class="outline-3">
<h3 id="org4959f53"><span class="section-number-3">1.1.</span> <a href="20231231131429-assignment_operators.html#ID-32c06110-1f45-4d85-9583-74d13aaa083f">Assignment Operators</a></h3>
</div>
<div id="outline-container-org3799eea" class="outline-3">
<h3 id="org3799eea"><span class="section-number-3">1.2.</span> <a href="20231231061730-arithmetic_operators.html#ID-f6e458df-99cf-45d6-b224-16f325cc1d2b">Arithmetic Operators</a></h3>
</div>
<div id="outline-container-org354142d" class="outline-3">
<h3 id="org354142d"><span class="section-number-3">1.3.</span> <a href="20231231063707-relational_operators.html#ID-bf93d4e3-f501-4e73-ac07-e1c6653831ba">Relational Operators</a></h3>
</div>
<div id="outline-container-orgdcf9c73" class="outline-3">
<h3 id="orgdcf9c73"><span class="section-number-3">1.4.</span> <a href="20240101093326-logical_operators.html#ID-e5c59266-2989-402e-a1cd-f05b5b29d14a">Logical Operators</a></h3>
</div>
<div id="outline-container-org2e9ab0a" class="outline-3">
<h3 id="org2e9ab0a"><span class="section-number-3">1.5.</span> <a href="20231231134004-compound_assignment_operators.html#ID-78097da7-2345-4299-8b00-4608c875fb88">Compound Assignment Operators</a></h3>
</div>
<div id="outline-container-org28898fc" class="outline-3">
<h3 id="org28898fc"><span class="section-number-3">1.6.</span> <a href="20231231063730-equality_operators.html#ID-700147ef-38e8-47dc-bdda-f675917ae802">Equality Operators</a></h3>
</div>
<div id="outline-container-orga07ffbe" class="outline-3">
<h3 id="orga07ffbe"><span class="section-number-3">1.7.</span> <a href="20231231063743-conditional_operators.html#ID-a29b45cb-d2f6-49fd-90c7-4c8f1b8e898a">Conditional Operators</a></h3>
</div>
<div id="outline-container-orgc8ad250" class="outline-3">
<h3 id="orgc8ad250"><span class="section-number-3">1.8.</span> <a href="20260121072551-exponent_operations.html#ID-084b3f68-cbfa-4f4d-b3fb-724a5ae1391b">Exponent Operations</a></h3>
</div>
</div>
</div>
</body>
</html>
